PeerEvaluationTool/app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("group_no", "rater", "ratee", "score", "rater_comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["group_no", 1], ["rater", "Starvaggi"], ["ratee", "Max"], ["score", 5], ["rater_comments", ""], ["created_at", "2021-12-09 22:00:43.582698"], ["updated_at", "2021-12-09 22:00:43.582698"]]
---
  def create
    @rating = Rating.new(rating_params)
    if @rating.save