PeerEvaluationTool/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."group_number" = ? LIMIT ?  [["group_number", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    t = @user.group_no
    @group = Group.find_by(group_number:t)